# Dotfiles Brewfile
# Generated from current system - run `brew bundle` to install all packages
# To update: `brew bundle dump --file=~/.dotfiles/Brewfile --force`

# ============================================================================
# Taps
# ============================================================================
tap "anomalyco/tap"
tap "caarlos0/tap"
tap "felixkratz/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "opencode-ai/tap"
tap "th-ch/youtube-music"

# ============================================================================
# CLI Tools - Core
# ============================================================================
brew "bash"
brew "bat"                        # Better cat
brew "btop"                       # System monitor
brew "cmake"
brew "eza"                        # Better ls
brew "fd"                         # Better find
brew "ffind"
brew "fzf"                        # Fuzzy finder
brew "gh"                         # GitHub CLI
brew "ghq"                        # Git repo manager
brew "go"
brew "jq"                         # JSON processor
brew "lua"
brew "lua-language-server"
brew "ncdu"                       # Disk usage analyzer
brew "neovim"                     # Editor
brew "node"
brew "pipx"
brew "rbenv"                      # Ruby version manager
brew "ripgrep"                    # Better grep
brew "ruby"
brew "stow"                       # Symlink manager (for this dotfiles repo)
brew "tmux"                       # Terminal multiplexer
brew "tree"
brew "yazi"                       # File manager TUI
brew "zoxide"                     # Better cd
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ============================================================================
# CLI Tools - Nice to Have
# ============================================================================
brew "ansible"
brew "ant"
brew "atuin"                      # Shell history
brew "cmatrix"                    # Matrix screensaver
brew "ffmpeg"
brew "figlet"                     # ASCII art text
brew "gmp"
brew "httpie"                     # Better curl
brew "icarus-verilog"
brew "imagemagick"
brew "kind"                       # Kubernetes in Docker
brew "lazygit"                    # Git TUI
brew "maven"
brew "mpv"                        # Media player
brew "mysql"
brew "neofetch"                   # System info
brew "nowplaying-cli"             # Show current playing track
brew "openjdk"
brew "openssl@3"
brew "pandoc"
brew "pkgconf"
brew "poppler"
brew "python-tk@3.12"
brew "redis"
brew "sevenzip"
brew "speedtest-cli"
brew "spotify_player"             # Spotify TUI
brew "sqlx-cli"
brew "switchaudio-osx"            # Audio output switcher
brew "tesseract"                  # OCR
brew "tlrc"                       # TLDR pages
brew "yarn", link: false
brew "yewtube"                    # YouTube TUI
brew "libyaml"
brew "icu4c@76"
brew "gemini-cli"

# ============================================================================
# Third-party CLI Tools
# ============================================================================
brew "anomalyco/tap/opencode"
brew "caarlos0/tap/timer"         # Pomodoro timer
brew "felixkratz/formulae/sketchybar"  # macOS status bar
brew "koekeishiya/formulae/skhd"       # Hotkey daemon
brew "koekeishiya/formulae/yabai"      # Tiling WM

# ============================================================================
# GUI Applications (Casks)
# ============================================================================
cask "nikitabobko/tap/aerospace"  # Tiling WM (alternative)
cask "anaconda"
cask "codex"
cask "ghostty"                    # Terminal emulator
cask "ubersicht"                  # Desktop widgets
cask "wezterm"                    # Terminal emulator
cask "th-ch/youtube-music/youtube-music"

# ============================================================================
# Fonts
# ============================================================================
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-symbols-only-nerd-font"
cask "sf-symbols"

# ============================================================================
# VS Code Extensions
# ============================================================================
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "prisma.prisma"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "sdras.night-owl"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "zhuangtongfa.material-theme"

# ============================================================================
# Language-specific packages (installed via brew)
# ============================================================================
# go "github.com/bootdotdev/bootdev"
# cargo "avm"
